# Data Wrangling & Subsetting
52. Importing and checking data sets
59. Dropping unnecessary columns
63. Check and change dtypes
67. Rename column
73. Import and transpose departments data set
84. Create data dictionary
87. Find busiest hour of the day
88. Create subset for breakfast items
90. Create subset for party items
93. Extract all info user_id 1 
95. Export

In [52]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [53]:
# Import data sets
df_ords = pd.read_csv(r'/Users/OldBobJulia/Desktop/CF/Course/4. Python/Instacart Basket Analysis/02 Data/Original data/orders.csv')

In [54]:
df_prods = pd.read_csv(r'/Users/OldBobJulia/Desktop/CF/Course/4. Python/Instacart Basket Analysis/02 Data/Original data/products.csv')

In [55]:
# Check shapes
df_ords.shape

(3421083, 7)

In [56]:
df_prods.shape

(49693, 5)

In [57]:
# Check heads
df_ords.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [58]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [59]:
# Drop unnecessary columns
df_ords = df_ords.drop(columns = ['eval_set'])

In [60]:
df_prods = df_prods.drop(columns = ['aisle_id'])

In [61]:
df_ords.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [62]:
df_prods.head()

,product_id,product_name,department_id,prices
0,1,Chocolate Sandwich Cookies,19,5.8
1,2,All-Seasons Salt,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,1,10.5
4,5,Green Chile Anytime Sauce,13,4.3

In [63]:
# Check data types df_ords
df_ords.dtypes

order_id                    int64
user_id                     int64
order_number                int64
order_dow                   int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

In [64]:
# Change order_id, user_id, order_number to string because not numeric
df_ords['order_id'] = df_ords['order_id'].astype('str')
df_ords['user_id'] = df_ords['user_id'].astype('str')
df_ords['order_number'] = df_ords['order_number'].astype('str')

In [65]:
# Change order_dow, order_hour_of_day, days_since... to save on RAM
df_ords['order_dow'] = df_ords['order_dow'].astype('int8')
df_ords['order_hour_of_day'] = df_ords['order_hour_of_day'].astype('int8')
df_ords['days_since_prior_order'] = df_ords['days_since_prior_order'].astype('float16')

In [66]:
df_ords.dtypes

order_id                   object
user_id                    object
order_number               object
order_dow                    int8
order_hour_of_day            int8
days_since_prior_order    float16
dtype: object

In [67]:
# Change name order_dow for clarity
df_ords.rename(columns = {'order_dow': 'orders_day_of_week'}, inplace = True)

In [68]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [69]:
# Check data types of df_prods 
df_prods.dtypes

product_id         int64
product_name      object
department_id      int64
prices           float64
dtype: object

In [70]:
# Do NOT change df_prods data types as it returns an error later on

In [72]:
df_prods.dtypes

product_id         int64
product_name      object
department_id      int64
prices           float64
dtype: object

In [73]:
# Import departments data set
df_dep = pd.read_csv(r'/Users/OldBobJulia/Desktop/CF/Course/4. Python/Instacart Basket Analysis/02 Data/Original data/departments.csv')

In [74]:
df_dep.head()

,department_id,1,2,3,4,5,6,7,8,9,...,12,13,14,15,16,17,18,19,20,21
0,department,frozen,other,bakery,produce,alcohol,international,beverages,pets,dry goods pasta,...,meat seafood,pantry,breakfast,canned goods,dairy eggs,household,babies,snacks,deli,missing

In [75]:
# Transpose
df_dep_t = df_dep.T

In [76]:
df_dep_t.head()

                        0
department_id  department
1                  frozen
2                   other
3                  bakery
4                 produce

In [77]:
# Add index
df_dep_t.reset_index()

            index                0
0   department_id       department
1               1           frozen
2               2            other
3               3           bakery
4               4          produce
5               5          alcohol
6               6    international
7               7        beverages
8               8             pets
9               9  dry goods pasta
10             10             bulk
11             11    personal care
12             12     meat seafood
13             13           pantry
14             14        breakfast
15             15     canned goods
16             16       dairy eggs
17             17        household
18             18           babies
19             19           snacks
20             20             deli
21             21          missing

In [78]:
# Create new header
new_header = df_dep_t.iloc[0]

In [79]:
new_header

0    department
Name: department_id, dtype: object

In [80]:
# Take all data under new header row for a new df
df_dep_t_new = df_dep_t[1:]

In [81]:
df_dep_t_new

                  0
1            frozen
2             other
3            bakery
4           produce
5           alcohol
6     international
7         beverages
8              pets
9   dry goods pasta
10             bulk
11    personal care
12     meat seafood
13           pantry
14        breakfast
15     canned goods
16       dairy eggs
17        household
18           babies
19           snacks
20             deli
21          missing

In [82]:
# Assigning new header as new column names
df_dep_t_new.columns = new_header

In [83]:
df_dep_t_new

department_id       department
1                       frozen
2                        other
3                       bakery
4                      produce
5                      alcohol
6                international
7                    beverages
8                         pets
9              dry goods pasta
10                        bulk
11               personal care
12                meat seafood
13                      pantry
14                   breakfast
15                canned goods
16                  dairy eggs
17                   household
18                      babies
19                      snacks
20                        deli
21                     missing

In [84]:
# Create data dictionary
data_dict = df_dep_t_new.to_dict('index')

In [85]:
data_dict

{'1': {'department': 'frozen'},
 '2': {'department': 'other'},
 '3': {'department': 'bakery'},
 '4': {'department': 'produce'},
 '5': {'department': 'alcohol'},
 '6': {'department': 'international'},
 '7': {'department': 'beverages'},
 '8': {'department': 'pets'},
 '9': {'department': 'dry goods pasta'},
 '10': {'department': 'bulk'},
 '11': {'department': 'personal care'},
 '12': {'department': 'meat seafood'},
 '13': {'department': 'pantry'},
 '14': {'department': 'breakfast'},
 '15': {'department': 'canned goods'},
 '16': {'department': 'dairy eggs'},
 '17': {'department': 'household'},
 '18': {'department': 'babies'},
 '19': {'department': 'snacks'},
 '20': {'department': 'deli'},
 '21': {'department': 'missing'}}

In [86]:
# We can find the specific department_id like this
print(data_dict.get('19'))

{'department': 'snacks'}

In [87]:
# Find busiest hour of the day
df_ords['order_hour_of_day'].value_counts(dropna = False)

10    288418
11    284728
15    283639
14    283042
13    277999
12    272841
16    272553
9     257812
17    228795
18    182912
8     178201
19    140569
20    104292
7      91868
21     78109
22     61468
23     40043
6      30529
0      22758
1      12398
5       9569
2       7539
4       5527
3       5474
Name: order_hour_of_day, dtype: int64

# The busiest hour of the day is 10:00

In [88]:
# Create subset for breakfast items
df_breakfast =  df_prods[df_prods['department_id']==14]

In [89]:
df_breakfast.head()

,product_id,product_name,department_id,prices
27,28,Wheat Chex Cereal,14,10.1
33,34,NaN,14,12.2
67,68,"Pancake Mix, Buttermilk",14,13.7
89,90,Smorz Cereal,14,3.9
210,211,Gluten Free Organic Cereal Coconut Maple Vanilla,14,3.6

In [90]:
# Create subset for departments alcohol, deli, beverages, meat/seafood
df_parties = df_prods.loc[df_prods['department_id'].isin([5,7,12,20])]

In [91]:
df_parties.head()

,product_id,product_name,department_id,prices
2,3,Robust Golden Unsweetened Oolong Tea,7,4.5
6,7,Pure Coconut Water With Orange,7,4.4
9,10,Sparkling Orange Juice & Prickly Pear Beverage,7,8.4
10,11,Peach Mango Juice,7,2.8
16,17,Rendered Duck Fat,12,17.1

In [92]:
# Change back data type of user_id to int
df_ords['user_id'] = df_ords['user_id'].astype('int32')

In [93]:
# Extract all info on user with user_id 1
df_user_1 =  df_ords[df_ords['user_id']==1]

In [94]:
df_user_1.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [95]:
# Export 
path = r'/Users/OldBobJulia/Desktop/CF/Course/4. Python/Instacart Basket Analysis/02 Data'

In [96]:
df_ords.to_csv(os.path.join(path,'Prepared Data', 'orders_wrangled.csv'))

In [97]:
df_prods.to_csv(os.path.join(path,'Prepared Data', 'prods_wrangled.csv'))

In [98]:
df_dep_t_new.to_csv(os.path.join(path,'Prepared Data', 'departments_wrangled.csv'))